app/Controllers/AlunoController.php

    public function historico()
    {
        $pedidoModel = new PedidoModel();

        $data['reservas'] = $pedidoModel->where('Usuario_id', session()->get('id'))->where('Pago', 1)->findAll();
---
SELECT *
FROM `Pedido`
WHERE `Usuario_id` = '28'
AND `Pago` = 1