app/Controllers/AlunoController.php

    public function cardapio()
    {
        $cardapioModel = new CardapioModel();

        $data['comidas'] = $cardapioModel->findAll();
---
SELECT *
FROM `Cardapio`

    public function pagamento()
    {
        $pedidoModel = new PedidoModel();

        $data['pedidos'] = $pedidoModel->where('Usuario_id', session()->get('id'))->findAll();
        $columnPreco = $pedidoModel->where('Usuario_id', session()->get('id'))->findColumn('Preco');
---
SELECT *
FROM `Pedido`
WHERE `Usuario_id` = '3'
SELECT `Preco`
FROM `Pedido`
WHERE `Usuario_id` = '3'