app/Controllers/AuthLogin.php

SELECT *
FROM `Usuario`
WHERE `Email` = 'aluno1@email.com'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $userModel = new UserModel();
        $email = $this->request->getVar('usuario');
        $senha = $this->request->getVar('senha');
        $usuario = $userModel->where('Email', $email)->first();