app/Controllers/CantinaController.php

    public function cardapio()
    {
        $cardapioModel = new CardapioModel();

        $data['comidas'] = $cardapioModel->findAll();
---
SELECT *
FROM `Cardapio`

    public function cadastros()
    {
        $userModel = new UserModel();
        $data['usuarios'] = $userModel->where('Tipo_usuario', 0)->where('Verificado', 1)->findAll();
---
SELECT *
FROM `Usuario`
WHERE `Tipo_usuario` = 0
AND `Verificado` = 1

    public function historico()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('Pedido');
        $builder->select('*');
        $builder->where('Pago', 1);
        $builder->join('Usuario', 'Usuario.id = Pedido.Usuario_id');
        $query = $builder->get();
---
SELECT *
FROM `Pedido`
JOIN `Usuario` ON `Usuario`.`id` = `Pedido`.`Usuario_id`
WHERE `Pago` = 1