app/Controllers/CantinaController.php

    public function cadastros()
    {
        $userModel = new UserModel();
        $data['usuarios'] = $userModel->where('Tipo_usuario', 0)->findAll();
---
SELECT *
FROM `Usuario`
WHERE `Tipo_usuario` = 0